[
    {
        "question_number": "1.1",
        "question_text": "Draw the block diagram of a computer and explain various blocks.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "1.2",
        "question_text": "What are various types of memory? How do they differ from each other.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "1.3",
        "question_text": "Compare the use and working of primary and secondary memory.\n1.4 What is need of an operating system? What are its responsibilities?\n1.5 What are the various types of operating systems? Compare their features and working.\n1.6 Explain the tree structure of storage system. Differentiate between absolute addressing and relative\naddressing of files.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "1.7",
        "question_text": "Write an algorithm, pseudo code and flow chart for finding",
        "sub_question_number": "i",
        "sub_question_text": "Minimum out of three numbers"
    },
    {
        "question_number": "1.7",
        "question_text": "Write an algorithm, pseudo code and flow chart for finding",
        "sub_question_number": "ii",
        "sub_question_text": "Maximum out of four numbers\"."
    },
    {
        "question_number": "1.7",
        "question_text": "Write an algorithm, pseudo code and flow chart for finding",
        "sub_question_number": "iii",
        "sub_question_text": "Factorial of a number"
    },
    {
        "question_number": "1.7",
        "question_text": "Write an algorithm, pseudo code and flow chart for finding",
        "sub_question_number": "iv",
        "sub_question_text": "Smallest out,of n numbers\n1.8 . List various phases of software development and describe each briefly."
    },
    {
        "question_number": "1.9",
        "question_text": "How is structured programming done? What problems might be faced if programs are not developed\nin a structured way? ,\n1.10 What is machine language? How does machine language differ from high-level languages?\n1.11 Name some commonly used high-level languages. What are the advantages of using high-level lan-\nguages?\n1.12 What is meant by compilation? What is meant by interpretation? How do these two processes differ?\n1.13 What are the major components of a C program? What significance is attached to the name main?\n1.14 How can comments (remarks) be included within a C program? Where can comments be placed?\n1.15 Are C programs required to be typed in lowercase? Is uppercase ever used in a C program? Explain.\n1.16 Why are some of the statements within a C program indented? Why are empty lines included within\na typical C program?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "1.17",
        "question_text": "Summarize the meaning of each of the following program characteristics: integrity, clarity, simplicity,\nefficiency, modularity and generality. Why is each characteristic important?\n1.18: Compare top-down and bottom-up approaches of program design.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2.1",
        "question_text": "Summarize the rules for naming identifiers. Are uppercase letters:equivalent to lowercase letters? Can:\ndigits be included in an identifier name? Can any special characters be included?\n2.2 What are the keywords in C? What restrictions apply to their use?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2.3",
        "question_text": "Name and describe the four basic data types in C.\n2.4 Name and describe the four data-type qualifiers. To which data types can each qualifier be applied?\n2.5 Summarize the rules that apply to all numeric-type constants.\n2.6 When writing. integer constants, how are decimal constants, octal constants and hexadecimal\nconstants distinguished from one another? ,",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2.7",
        "question_text": "Typically, what is the largest permissible magnitude of an integer constant? State your answer in deci-\nmal, octal and hexadecimal.\n2.8 What are unsigned integer constants? What are long integer constants? How do these constants.differ\nfrom ordinary integer constants? How can they be written and identified?\n2.9 Describe two-different ways that floating-point constants can be written. What special rules apply in\neach case?) fe rn\n2.10 What is the purpose of the (optional), exponent in a floating-point constant?\n2.11 Typically, what is the largest permissible magnitude of a floating-point constant? Compare with an\ninteger constant. ae ;\n2.12 How can \"single-precision\" and \"long\" floating-point constants be written and identified?\n2.13 Describe the differences in accuracy between integer, and floating-point constants. Under what cir-\ncumstances should each type of constant be used?\n2.14 What is a character constant? How do character constants differ from numeric-type constants? Do\ncharacter constants represent numerical values?\n2.15 What is the ASCII character set? How common is its use?\n2.16 What is an escape sequence? What is its purpose? :\n2.17 Summarize the standard escape sequences in C. Describe other commonly available nonstandard\nescape sequences.\n2.18 What is a string constant? How do string constants differ from character constants? Do string con-\nstants represent numerical values?\n\n2.19 Can escape sequences be included in a string constant? Explain.\n\n2.20 What is a variable? How can variables be characterized?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2.21",
        "question_text": "What is an array variable? How does an array variable differ from an ordinary variable?\n\n2.22 How can individual array elements be distinguished from one another?\n\n2.23 What is a subscript? What range of values is permitted for the subscript of a one-dimensional, n.-\nelement array?\n\n2.24 What is the purpose of a type declaration? What does a type declaration consist of?\n\n2.25 How are initial values assigned to variables within a type declaration? How are strings assigned \\\none-dimensional, character-type arrays?\n\n2.26 What is an expression? What kind of information is represented by an expression?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2.27",
        "question_text": "What is an operator? Describe several different types of operators that are included within the C Ian-\nguage.\n\n2,28 Can statements be embedded within other statements? Explain.\n\n2.29 What is a symbolic constant? How is a symbolic constant defined? How is the definition written?\nWhere must a symbolic constant definition be placed within a C program?\n\n2.30 During the compilation process, what happens to symbolic constants that appear within a C program?\n\n3.1 Describe the five arithmetic operators in C. Summarize the rules associated with their use.\n\n3.2 Summarize the rules that apply to expressions operands of which are of different types.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "3.3",
        "question_text": "How can the value of an expression be converted to a different data type? What is it called?\n\n3.4 | What is meant by operator precedence? What are the relative precedences of arithmetic operators?\n\n3.5 What is meant by associativity? What is the associativity of arithmetic operators?\n\n3.6 | What are unary operators? How many operands are associated with an unary operator?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "3.7",
        "question_text": "Describe the six unary operators discussed in this chapter. What is the purpose of each?\n\n3.8 Describe two different ways to utilize the increment and decrement operators. How do the two meth-\nods differ?\n\n3.9 | What is the relative precedence of unary operators when compared with arithmetic operators? What is\ntheir associativity?\n\n3.10 How can the number of bytes allocated to each data type be determined for a particular C compiler?\n\n3.11 Describe the four relational operators included in C. With what type of operands can they be used?\nWhat type of expression is obtained?\n\n3.12 What are the relative precedences of the relational, equality and logical operators with respect to one\nanother and with respect to the arithmetic and unary operators? What are their associativities?\n\n3.13 How is the type of an assignment expression determined when the two operands are of different data\ntypes? In what sense is this situation sometimes a source of programming errors?\n\n3.14 What is the precedence of assignment operators relative to other operators? What is their associativity?\n\n3.15 Describe the use of the conditional operator to form conditional expressions. How is a conditional\nexpression evaluated?\n\n3.16 How can the conditional operator be combined with the assignment operator to form an \"if - else\" type\nstatement?\n\n3.17 What is the precedence of the conditional operator relative to the other operators as described in this\nchapter? What is its associativity?\n\n3.18 Are the library functions actually a part of the C language? Explain.\n\n4.1 What are the commonly used input/output functions in C? What additional instruction is to be written\nin aC program to use these?\n\n* 4.2 ' What happens when an end-of-file condition is encountered when reading characters with the getchar\nfunction? How is the end-of-file condition recognized?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "4.3",
        "question_text": "What is the purpose of the scanf function? How is it used within a-C program? Compare with the\ngetchar function. g\n\n4.4 What is the purpose of the control string in a scanf function? What type of information does it convey?\nOf what is the control string composed?\n\n4.5: Ifacontrol string within a scanf function contains multiple character groups, how are the character\ngroups separated? Are whitespace characters required? If whitespace characters are present within a\ncontrol string, how are they interpreted? a jMHG\n\n4.6 Summarize the meaning of the more commonly used conversion characters within the control string of\nascanf function. Cgas A",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "4.7",
        "question_text": "When entering data via the scanf function, what relationships must there be between the data items\nand the corresponding arguments? How are multiple data items separated from one another?\n\n4.8 When entering data via the scanf function, must octal data be preceded by 0? Must hexadecimal data\nbe precéded by 0x (or 0X)? How must floating-point data be written?\n\n4.9 When entering a string via the scanf function using an s-type Conversion factor; how is the string\nterminated?\n\n4.10 When entering a string via the scanf function, how can a single string which includes whitespace\ncharacters be entered?\n\n4.11 Summarize a convenient method for entering a string of undetermined length, which may contain\nwhitespace characters and all printable characters, and which is terminated by a carriage return. Answer\n\n' this question relative to the type of conversion required within the control string of ascanf function.\n\n4.12 What is meant by a field? How can the maximum field width for a'data item be specified within a\nscanf function?\n\n4.13 What happens if an input data item contains more characters than the maximum allowable field width?\nWhat if the data item contains fewer characters?\n\n4.14 How can short integer, long integer and double-precision arguments be indicated within the control\nstring ofa scanf function?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "4.15",
        "question_text": "How can the assignment of an input data item suppressed to its corresponding argument be?\n4.16: What is the purpose of the printf function? How is it used within a C program? Compare with the\n- putchar function.\n\n4.17 In what ways does the control string within a print £ function differ from the control string within a\nscanf function?\n\n4.18 Ifthe control string within a printf function contains multiple character groups, how are the character\ngroups separated? How are the separators interpreted?\n\n4.19 Summarize the meaning of the more commonly used conversion characters within the contro]\nstring of a printf function. Compare with the conversion characters that aré used in a scanf\nfunction.\n\n4.20 Ina printf function, the arguments (other than the control string) must be preceded by ampersands?\nCompare with the scanf function and explain any differences.\n\n4.21 What is the difference between f-type conversion, e-type conversion and g-type conversion when\noutputting floating-point data with a printf function?\n\n4.22 Compare the use of s-type conversion with the printf and scanf functions. How does s-type con-\nversion differ when processing strings contain whitespace characters?\n\n4.23 How can the minimum field width for a data item be specified within the printf function?\n\n4.24 What happens if an output data item contains more characters than the minimum field width? What if the\ndata item contains fewer characters? Contrast with the field width specifications in the scanf function.\n\n4.25 What is meant by the precision of an output data item? To what types of data does this apply? How can\nthe precision be specified within a printf function?\n\n4.26 What.happens to.a floating-point number if it will be shortened to conform to a precision specification?\nWhat happens to a string? A\n\n4.27 How:can short integer, long. integer and double-precision arguments be indicated within the control\nstring of a printf function? How can long double arguments be indicated?\n\n4.28 Summarize the purpose of the flags that are commonly used within the printf function.\n\n4.29 Summarize the use of the gets, and puts functions to transfer strings between a computer and\nstandard input/output devices. Compare the use of these functions with the string transfer features in\nthe scanf and print£ statements.\n\n5.1 What is meant by \"top-down\" programming? What are its advantages? How is it carried out?\n\n5.2 What is meant by \"bottom-up\" programming? How does it differ from top-down programming?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "5.3",
        "question_text": "Why are some statements indented within a C program? Is this indentation absolutely necessary?\n\n5.4 What are the reasons for placing comments within a C program? How extensive should these\ncomments be?\n\n5.5 What is a syntactic error? Name some common syntactic errors.\n\n5.6 | What is an execution error? Name some common execution errors.\n\n5.7 'How do syntactic errors and execution errors differ from one another?\n\n5.8 What is a logical error? How do logical errors differ from-syntactic and execution errors?\n\n5.9 Whats the difference between compilation messages and execution messages? Name some situations\nin which each type of diagnostic message would be generated.\n\n5.10 What is an error isolation? What is it used for? How is error isolation carried out?\n\n5.11 What is tracing? What is it used for? How is tracing carried out?\n\n5.12 What is an interactive debugger? What special features are made available by a debugger?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "5.13",
        "question_text": "What are watch values? What are watch value used for? In general terms, how are watch values de-\nfined?\n\n5.14 What are breakpoints? What are they used for? In general terms, how. are breakpoints defined?\n\n5.15 What is stepping? What is it used for? In general terms, how is stepping carried out?\n\n5.16 Describe how watch values can be used with breakpoints and stepping to monitor the progress of a\nprogram's execution.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "a",
        "sub_question_text": "Print HELLO! at the beginning of a line..;"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "2",
        "sub_question_text": "Have the computer print\nHI, WHAT'S YOUR NAME?\non one line. The user then enters his or her name immediately after the question mark. The com-\nputer then skips two lines and prints\nWELCOME"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "c",
        "sub_question_text": "Convert a temperature reading in degrees Fahrenheit to degrees Celsius, using the formula\n- C="
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "d",
        "sub_question_text": "Determine how much money"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "e",
        "sub_question_text": "Calculate the volume and area of a sphere using the formulas\nV = 4nr7/3\n\nA=4nr?\nTest the program using the following values for the radius: 1, 6, 12.2, 0.2."
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "f",
        "sub_question_text": "Calculate the mass of air in an automobile tire, using the formula\nPV = 0.37 m"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "g",
        "sub_question_text": "Read a five-letter word into the computer, then encode the word on a letter-by-letter basis by\nsubtracting 30 from the numerical value that is used to represent each letter. Thus if the ASCII\ncharacter set is being used, the letter a"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "A",
        "sub_question_text": "Read into the computer a five-letter word that has been encoded using the scheme described\nabove. Decode the word by reversing the above procedure, then write out the decoded word."
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "i",
        "sub_question_text": "Read an entire line of text into the computer, encoding it as it is read in, using the method\ndescribed in part"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "g",
        "sub_question_text": ". Display the entire line of text in encoded form. Then decode the text\nand write it out"
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "A",
        "sub_question_text": "."
    },
    {
        "question_number": "5.1",
        "question_text": "Example 1:6 presents a C program for calculating the area of a circle, given its radius. Enter this prograr\ninto your computer and make any necessary modifications, such as #include <stdio.h>. Be sure tc\ncorrect any typing errors. List the program after it has been stored within the computer. When you are sure\nthat it is correct, compile the program and then execute the object program using several different values\nfor the radius. Verify that the computed answers are correct by comparing them with hand calculations.\n\n5.2 Enter, compile and execute the C programs given in Examples 2.6 through 2.8. Verify that they run\ncorrectly with your particular version of C. (If any of the programs do not run, try to determine why.)\n\n5.3 Repeat Prog. Prob. 5.2 for a few of the programs given in Prob..1.1 (problems).\n\n5.4 Example 5.2 presents a C program for determining the future value of a savings account if the interest\nis allowed to accumulate and compound annually. Enter this program into the computer and save it,\nthen run the program using several different sets of input data. Verify that the calculated results are\ncorrect by comparing them with calculations carried out by hand, with the aid of a calculator.\n\n5.5 Write a complete C program for each of the following problem situations. Enter each program into the\nprogram, then compile and execute. Be sure to include prompts for all input data, and label all output.",
        "sub_question_number": "j",
        "sub_question_text": "Read into the computer a line of text containing both uppercase and lowercase letters.\nWrite out the text with the uppercase and lowercase letters reversed, but all other characters\nintact."
    },
    {
        "question_number": "8.3",
        "question_text": "How isan automatic variable defined? How is it initialized? What happens if an automatic variable is\nnot explicitly initialized within a function?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "8.4",
        "question_text": "What is the purpose of an external variable? What is its scope?\n\n3.5 Summarize the distinction between an external variable definition and an external variable declaration.\n\n8.6 How is an external variable defined? How is it initialized? What happens if an external variable\ndefinition does not include the assignment of an initial value? Compare your answers with those for\nautomatic variables.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "8.7",
        "question_text": "Suppose an external variable is defined outside of function A and accessed within the function. Does\nit matter whether the external variable is defined before or after the function? Explain.\n\n8.8 In what way is the initialization of an external variable more restricted than the initialization of.an\nautomatic variable?\n\n8.9 What is the purpose of a static variable in a single-file program? What is its scope? .\n\n8.10 How isa static variable defined in a single-file program? How is.a static variable initialized? Compare\nwith automatic variables. pe:\n\n8.11 Under what circumstances might it be desirable to have a program composed of several! different files?\n\n8.12 Ina multifile program, what is the default storage class for a function if a storage class is not explicitly\nincluded in the function definition?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "8.13",
        "question_text": "What is the purpose of a static function in a multifile program?\n\n8.14 Compare the definition of external variables within a multifile program with the definition of external\nvariables within a single-file program. What additional options are available in the multifile case?\n\n8.15 Under what circumstances can an external variable be defined to be static? What advantage might\nthere be in doing this?\n\n8.16 What is the scope of a static external variable?\n\n9:1 What are subscripts? How are they written? What restrictions apply to the values that can be assigned\nto subscripts?\n\n9.2 What is the advantage in defining an array size in terms of a symbolic constant instead of a fixed inte-\nger quantity?\n\n9.3 Can initial values be specified within an external array definition? Can they be specified within a static\narray definition? Can they be specified within an automatic array definition?\n\n9.4 Howare initial values written in a one-dimensional array definition? Must the entire array be initialized?\n\n9.5 What value is automatically assigned to those array elements that are not explicitly initialized?\n\n9.6 When are array declarations (in contrast to array definitions) required in a C program? How do such\ndeclarations differ from array definitions?\n\n9.7 How are arrays usually processed in C? Can entire arrays be processed with single instructions, with-\nout repetition?\n\nrr\nya\n9.8 When passing an array to a function, how must the array argument be written? How must the corre.\n\nsponding formal argument be written?\n\n9.9 How is an array name interpreted when it is passed to a function?\n\n9.10 When passing an argument to a function, what is the difference between passing by value and passing\nby reference? To what types of arguments does each apply?\n\n9.11 Ifan array is passed to a function and several of its elements are altered within the function, are these\nchanges recognized in the calling portion of the program? Explain.\n\n9.12 Can an array be passed from a function to the calling portion of the program via a return statement?\n\n9.13, How are multi-dimensional arrays defined? Compare this with the manner in which one-dimensional\narrays are defined.\n\n9.14 State the rule that determines the order in which initial values are assigned to multi-dimensional array\nelements. ,\n\n9.15 When assigning initial values to the elements of a multi-dimensional array, what advantage is there to\nforming groups of initial values, where each group is enclosed in its own set of braces?\n\n9,16 When a multi-dimensional-array is passed to a function, how are the formal argument declarations\nwritten? Compare with one-dimensional arrays. 1\n\n= Te ee ea te ee ae ee\n\n9.1 Modify the program given in Example 9.8 (deviations about an average) to include two additional\nfunctions. Have the first function read in the numbers to be averaged, calculating their sum as they are\nentered. The second function should calculate the deviations about the average. All the remaining program\nfeatures (reading in a value for n, calculating a value for the average, displaying the calculated average\nand displaying the deviations about the average) should be carried out in the main portion of the program.\n\n9.2 Modify the program given in Example'9.9 (deviations about an average revisited) to include two\n\nadditional functions. Calculate and display the average in the first function. Calculate and display the\ndeviations about the average in the second function.\n\n9.3 Modify the program given in Example 9.13 (reordering a list of numbers) so that the numbers are rear-\n\nranged into a sequence of decreasing values (i.e., from largest to smallest). Test the program using the\ndata given in Example 9.13.\n9.4 Modify the program given in Example 9.13 (reordering a list of numbers) so that any one of the fol-\nlowing rearrangements can be carried out: ",
        "sub_question_number": "a",
        "sub_question_text": "Smallest to largest, by magnitude"
    },
    {
        "question_number": "8.13",
        "question_text": "What is the purpose of a static function in a multifile program?\n\n8.14 Compare the definition of external variables within a multifile program with the definition of external\nvariables within a single-file program. What additional options are available in the multifile case?\n\n8.15 Under what circumstances can an external variable be defined to be static? What advantage might\nthere be in doing this?\n\n8.16 What is the scope of a static external variable?\n\n9:1 What are subscripts? How are they written? What restrictions apply to the values that can be assigned\nto subscripts?\n\n9.2 What is the advantage in defining an array size in terms of a symbolic constant instead of a fixed inte-\nger quantity?\n\n9.3 Can initial values be specified within an external array definition? Can they be specified within a static\narray definition? Can they be specified within an automatic array definition?\n\n9.4 Howare initial values written in a one-dimensional array definition? Must the entire array be initialized?\n\n9.5 What value is automatically assigned to those array elements that are not explicitly initialized?\n\n9.6 When are array declarations (in contrast to array definitions) required in a C program? How do such\ndeclarations differ from array definitions?\n\n9.7 How are arrays usually processed in C? Can entire arrays be processed with single instructions, with-\nout repetition?\n\nrr\nya\n9.8 When passing an array to a function, how must the array argument be written? How must the corre.\n\nsponding formal argument be written?\n\n9.9 How is an array name interpreted when it is passed to a function?\n\n9.10 When passing an argument to a function, what is the difference between passing by value and passing\nby reference? To what types of arguments does each apply?\n\n9.11 Ifan array is passed to a function and several of its elements are altered within the function, are these\nchanges recognized in the calling portion of the program? Explain.\n\n9.12 Can an array be passed from a function to the calling portion of the program via a return statement?\n\n9.13, How are multi-dimensional arrays defined? Compare this with the manner in which one-dimensional\narrays are defined.\n\n9.14 State the rule that determines the order in which initial values are assigned to multi-dimensional array\nelements. ,\n\n9.15 When assigning initial values to the elements of a multi-dimensional array, what advantage is there to\nforming groups of initial values, where each group is enclosed in its own set of braces?\n\n9,16 When a multi-dimensional-array is passed to a function, how are the formal argument declarations\nwritten? Compare with one-dimensional arrays. 1\n\n= Te ee ea te ee ae ee\n\n9.1 Modify the program given in Example 9.8 (deviations about an average) to include two additional\nfunctions. Have the first function read in the numbers to be averaged, calculating their sum as they are\nentered. The second function should calculate the deviations about the average. All the remaining program\nfeatures (reading in a value for n, calculating a value for the average, displaying the calculated average\nand displaying the deviations about the average) should be carried out in the main portion of the program.\n\n9.2 Modify the program given in Example'9.9 (deviations about an average revisited) to include two\n\nadditional functions. Calculate and display the average in the first function. Calculate and display the\ndeviations about the average in the second function.\n\n9.3 Modify the program given in Example 9.13 (reordering a list of numbers) so that the numbers are rear-\n\nranged into a sequence of decreasing values (i.e., from largest to smallest). Test the program using the\ndata given in Example 9.13.\n9.4 Modify the program given in Example 9.13 (reordering a list of numbers) so that any one of the fol-\nlowing rearrangements can be carried out: ",
        "sub_question_number": "b",
        "sub_question_text": "Smallest to largest, algebraic"
    },
    {
        "question_number": "8.13",
        "question_text": "What is the purpose of a static function in a multifile program?\n\n8.14 Compare the definition of external variables within a multifile program with the definition of external\nvariables within a single-file program. What additional options are available in the multifile case?\n\n8.15 Under what circumstances can an external variable be defined to be static? What advantage might\nthere be in doing this?\n\n8.16 What is the scope of a static external variable?\n\n9:1 What are subscripts? How are they written? What restrictions apply to the values that can be assigned\nto subscripts?\n\n9.2 What is the advantage in defining an array size in terms of a symbolic constant instead of a fixed inte-\nger quantity?\n\n9.3 Can initial values be specified within an external array definition? Can they be specified within a static\narray definition? Can they be specified within an automatic array definition?\n\n9.4 Howare initial values written in a one-dimensional array definition? Must the entire array be initialized?\n\n9.5 What value is automatically assigned to those array elements that are not explicitly initialized?\n\n9.6 When are array declarations (in contrast to array definitions) required in a C program? How do such\ndeclarations differ from array definitions?\n\n9.7 How are arrays usually processed in C? Can entire arrays be processed with single instructions, with-\nout repetition?\n\nrr\nya\n9.8 When passing an array to a function, how must the array argument be written? How must the corre.\n\nsponding formal argument be written?\n\n9.9 How is an array name interpreted when it is passed to a function?\n\n9.10 When passing an argument to a function, what is the difference between passing by value and passing\nby reference? To what types of arguments does each apply?\n\n9.11 Ifan array is passed to a function and several of its elements are altered within the function, are these\nchanges recognized in the calling portion of the program? Explain.\n\n9.12 Can an array be passed from a function to the calling portion of the program via a return statement?\n\n9.13, How are multi-dimensional arrays defined? Compare this with the manner in which one-dimensional\narrays are defined.\n\n9.14 State the rule that determines the order in which initial values are assigned to multi-dimensional array\nelements. ,\n\n9.15 When assigning initial values to the elements of a multi-dimensional array, what advantage is there to\nforming groups of initial values, where each group is enclosed in its own set of braces?\n\n9,16 When a multi-dimensional-array is passed to a function, how are the formal argument declarations\nwritten? Compare with one-dimensional arrays. 1\n\n= Te ee ea te ee ae ee\n\n9.1 Modify the program given in Example 9.8 (deviations about an average) to include two additional\nfunctions. Have the first function read in the numbers to be averaged, calculating their sum as they are\nentered. The second function should calculate the deviations about the average. All the remaining program\nfeatures (reading in a value for n, calculating a value for the average, displaying the calculated average\nand displaying the deviations about the average) should be carried out in the main portion of the program.\n\n9.2 Modify the program given in Example'9.9 (deviations about an average revisited) to include two\n\nadditional functions. Calculate and display the average in the first function. Calculate and display the\ndeviations about the average in the second function.\n\n9.3 Modify the program given in Example 9.13 (reordering a list of numbers) so that the numbers are rear-\n\nranged into a sequence of decreasing values (i.e., from largest to smallest). Test the program using the\ndata given in Example 9.13.\n9.4 Modify the program given in Example 9.13 (reordering a list of numbers) so that any one of the fol-\nlowing rearrangements can be carried out: ",
        "sub_question_number": "c",
        "sub_question_text": ". Largest to smallest, by magnitude"
    },
    {
        "question_number": "8.13",
        "question_text": "What is the purpose of a static function in a multifile program?\n\n8.14 Compare the definition of external variables within a multifile program with the definition of external\nvariables within a single-file program. What additional options are available in the multifile case?\n\n8.15 Under what circumstances can an external variable be defined to be static? What advantage might\nthere be in doing this?\n\n8.16 What is the scope of a static external variable?\n\n9:1 What are subscripts? How are they written? What restrictions apply to the values that can be assigned\nto subscripts?\n\n9.2 What is the advantage in defining an array size in terms of a symbolic constant instead of a fixed inte-\nger quantity?\n\n9.3 Can initial values be specified within an external array definition? Can they be specified within a static\narray definition? Can they be specified within an automatic array definition?\n\n9.4 Howare initial values written in a one-dimensional array definition? Must the entire array be initialized?\n\n9.5 What value is automatically assigned to those array elements that are not explicitly initialized?\n\n9.6 When are array declarations (in contrast to array definitions) required in a C program? How do such\ndeclarations differ from array definitions?\n\n9.7 How are arrays usually processed in C? Can entire arrays be processed with single instructions, with-\nout repetition?\n\nrr\nya\n9.8 When passing an array to a function, how must the array argument be written? How must the corre.\n\nsponding formal argument be written?\n\n9.9 How is an array name interpreted when it is passed to a function?\n\n9.10 When passing an argument to a function, what is the difference between passing by value and passing\nby reference? To what types of arguments does each apply?\n\n9.11 Ifan array is passed to a function and several of its elements are altered within the function, are these\nchanges recognized in the calling portion of the program? Explain.\n\n9.12 Can an array be passed from a function to the calling portion of the program via a return statement?\n\n9.13, How are multi-dimensional arrays defined? Compare this with the manner in which one-dimensional\narrays are defined.\n\n9.14 State the rule that determines the order in which initial values are assigned to multi-dimensional array\nelements. ,\n\n9.15 When assigning initial values to the elements of a multi-dimensional array, what advantage is there to\nforming groups of initial values, where each group is enclosed in its own set of braces?\n\n9,16 When a multi-dimensional-array is passed to a function, how are the formal argument declarations\nwritten? Compare with one-dimensional arrays. 1\n\n= Te ee ea te ee ae ee\n\n9.1 Modify the program given in Example 9.8 (deviations about an average) to include two additional\nfunctions. Have the first function read in the numbers to be averaged, calculating their sum as they are\nentered. The second function should calculate the deviations about the average. All the remaining program\nfeatures (reading in a value for n, calculating a value for the average, displaying the calculated average\nand displaying the deviations about the average) should be carried out in the main portion of the program.\n\n9.2 Modify the program given in Example'9.9 (deviations about an average revisited) to include two\n\nadditional functions. Calculate and display the average in the first function. Calculate and display the\ndeviations about the average in the second function.\n\n9.3 Modify the program given in Example 9.13 (reordering a list of numbers) so that the numbers are rear-\n\nranged into a sequence of decreasing values (i.e., from largest to smallest). Test the program using the\ndata given in Example 9.13.\n9.4 Modify the program given in Example 9.13 (reordering a list of numbers) so that any one of the fol-\nlowing rearrangements can be carried out: ",
        "sub_question_number": "d",
        "sub_question_text": "Largest to smallest, algebraic\nInclude a menu that will allow the user to select which rearrangement will be used each time the pro-\ngram is executed. Test the program using the following 10 values.\n47 — 8.0\n='2.3 11.4\n12.9 5.1\n8.8 — 0.2\n6.0 — 14.7\n\n9.5 Modify the piglatin generator given in Example 9:14 so that it can accommodate punctuation marks,\nuppercase letters and double-letter sounds.\n\n9.6 Modify the program given in Example 9.19"
    },
    {
        "question_number": "1",
        "question_text": "Convert each character, including blank spaces, to its ASCII equivalent.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "2",
        "question_text": "Generate a positive random integer. Add this integer to the ASCII equivalent of each character. T\nsame random integer will be used for the entire line of text.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "3",
        "question_text": "Suppose that N1 represents the lowest permissible value in the ASCII code, and N2 represents &\nhighest permissible value. If the number obtained in Step 2 above (i-e., the original ASCII equis#\nlent plus the random integer) exceeds N2, then subtract the largest possible multiple of N2 from t!\nnumber, and add the remainder to N1. Hence, the encoded number will always fall between N! 2*\nN2, and will therefore always represent some ASCII character.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "4",
        "question_text": "Display the characters that correspond to the encoded ASCII values.\nThe procedure is reversed when decoding a line of text. Be certain, however, that the same rando\"\nnumber is used in decoding as was used in encoding.\n\n10.1 How strings differ from the other arrays?\n10.2 How gets differs from scanf using %s?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "10.3",
        "question_text": "List four methods to read a line of text consisting of blanks also.\n10.4 How can we find ASCII codes of alphabets a to z and A to Z?\n10.5 What are return values of strstr function? Give an example to use it.\n10.6 What is null character? What are its advantages in strings?\n10.7 Compare the working of strncmp, strcmp and strempi functions.\n10.8 Describe the manner in which an initial string constant is most commonly assigned to a one-dimensio?\ncharacter array, Can a similar procedure be used to assign values to a one-dimensional numerical at\n10.9 Whena one-dimensional character array of unspecified length is assigned an initial value, what\ncharacter is automatically added to the end of the string? :\n10.10 How can a list of strings be stored within a two-dimensional array? How can individual strings*\nprocessed? What library functions are available to simplify string processing?\n\n10.1 Write a program to search the last occurrence of a substring in a given string.\n\n10.2 Write a program to separate a given string into two strings, such that all odd positioned characters are\nstored in the first string and all even positioned characters in the second string.\n\n10.3 Write a program which counts the number of vowels, consonants, digits and other symbols in a given\nline of text. tisk lege\n\n10.4 Write a program which replaces a substring with another in a given line of text. For example, in the line\n\"There are 30 bananas on a banana tree.\", if the substring banana is to be replaced with apple, then the\nline should become \"There are 30 apples on an apple tree.\" .\n\n10.5 Write a program to reverse a string without using the strrev function. No extra string should be used :\nand the source string itself should be modified to store the reversed string. Number of exchanges should b |\nminimum.\n\n10.6 Consider the following list of countries and their capitals.\n\nCanada Ottawa\n\nEngland London\n\nFrance Paris\n\nGermany Bonn\n\nIndia New Delhi\n\nIsrael Jerusalem\n\nItaly Rome\n\nJapan Tokyo\n\nMexico Mexico City\n\nPeople's Republic of China Beijing\n\nRussia Moscow\n\nUnited States Washington\nWrite an interactive C program that will accept the name of a country as input and display the corre-\nsponding capital, and vice versa. Design the program so that it executes repeatedly, until the word End\nis entered as input.\n\n11.1 For the version of C available on your particular computer, how many memory cells are required to\nstore a single character? An integer quantity? A long integer? A floating-poing quantity? A double-\nprecision quantity?\n\n11.2 What is meant by the address of a memory cell? How are addresses usually numbered?\n\n11.3 How isa variable's address determined?\n\n11.4 What is the purpose of the indirection operator? To what type of operand must the indirection operator\nbe applied?\n\n11.5 What precedence is assigned to the unary operators compared with the multiplication, division and\nremainder operators? In what order are the unary operators evaluated?\n\n11.6 Can the address operator act upon an arithmetic expression, such as 2 * (u + v)? Explain the reasons\nfor your answer.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "11.7",
        "question_text": "Can an expression involving the indirection operator appear on the left side of an assignment 'state-\nment? Explain.\n\n11.8 How isa pointer variable declared? What is the purpose of the data type included in the declaration?\n\n11.9 In what way can the assignment of an initial value be included in the declaration of a pointer variable?\n\n11.10 Why is it sometimes desirable to pass a pointer to a function as an argument?\n\n11.11 Suppose a function receives a pointer as an argument. Explain how the function prototype is written.\nIn particular, explain how the data type of the pointer argument is represented.\n\n11.12 What is the relationship between an array name and a pointer? How is an array name interpreted when\nit appears as an argument to a function?\n\n11.13 Suppose a formal argument within a function definition is an array. How can the array be declared\nwithin the function?\n\n11.14 How can a portion of an array be passed to a function?\n\n11.15 How can a function return a pointer to its calling routine?\n\n11.16 Describe two different ways to specify the address of an array element, Describe two different ways\nto access an array element.\n\n11.17 Can an address be assigned to an array name or an array element? Can an address be assigned to a\npointer variable whose object is an array?\n\n11.18 Suppose a character-type array is defined in terms of a pointer variable. Can the individual array ele-\nments be initialized? Compare your answer with that of the previous question.\n\n11.19 What is meant by dynamic memoty allocation? What library function is used to allocate memory\ndynamically? How is the size of the memory block specified? What kind of information is returned by\nthe library function? :\n\n11.20 Suppose an integer quantity is added to or subtracted from a pointer variable. How will the sum er\ndifference be interpreted?\n\n11.21 Under what conditions can one pointer variable be subtracted from another? How will this difference\nbe interpreted?\n\n11.22 Under what conditions can two pointer variables. be compared? Under what conditions are such cont\nparisons useful?\n\n11.23 How is a multidimensional array defined in terms of a pointer to a collection of contiguous arrays of\nlower dimensionality? :\n\n11.24 How can the indirection operator be used to access a multidimensional array element?\n\n41.25 How is a multidimensional array defined in terms of an array of pointers? What does each pointer\nrepresent? How does this definition differ from a pointer to a collection of contiguous arrays of lower\ndimensionality?\n\n11.26 If several strings are stored within a-one-dimensional array of pointers, how can an individual string\n'be accessed?\n11.27 If several strings are stored within a one-dimensional array of pointers, what happens if the strings are\nreordered? Are the strings actually moved to different locations within the array?\n11.28 Under what conditions can the elements of a multidimensional array be initialized if the array is\ndefined in terms of an. array of pointers?\n11.29 Suppose a formal argument within a host function definition is a pointer to another function. How is\n| _ the formal argument declared? Within the declaration, to what does the data type refer?\n| 11.30 Suppose a formal argument within the definition of the host function p is a pointer to the guest\n| function q. How is the formal argument declared within p? In this declaration, to what does the data\n| type refer? How is function g accessed within function p?\n11.31 Suppose that p is a host function, and one of p's arguments is a pointer to function q. How would the\n| declaration for p be written if full function prototyping is used?\n_ 11.32 For what types of applications is it particularly useful to pass one function to another?\n\n11.18 Write a complete C program, using pointer notation, that will generate a table containing the following\n\nthree columns:\nt ae\" sin ct ae\" cos ct\nStructure the program in the following manner: Write two special functions, £1 and £2, where £1\nevaluates the quantity ae\" sin ct and f2 evaluates ae™ cos ct. Have main enter the values of a, b\nand c, and then call a function, table gen, which will generate the actual table. Pass £1 and £2 to\ntable gen as arguments.\nTest the program using the values a = 2, b = — 0.1, c = 0.5 where the values of fare 1, 2,3, ..., 60.",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "12.1",
        "question_text": "What is a structure? How does a structure differ from an array?\n\n12.2 Describe the syntax for defining the composition of a structure. Can individual members be initialized\nwithin a structure type declaration?\n\n12.3 How can structure variables be declared? How do structure variable declarations differ from structure\ntype declarations?\n\n12.4 What is a tag? Must a tag be included in a structure type definition? Must a tag be included in a struc-\nture variable declaration? Explain the complete process.\n\n12.5 Cana structure variable be defined as a member of another structure? Can an array be included as a\nmember of a structure? Can an array have structures as elements? —\n\n12.6 How are the members of a structure variable assigned initial values? What restrictions apply to the\nstructure's storage class when initial values are assigned?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "12.7",
        "question_text": "What is the scope of a member name? What does this imply with respect to the naming of the mem-\nbers within different structures?\n\n12.8 How isa structure member accessed? How can a structure member be processed?\n\n12.9 What is the precedence of the period (.) operator? What is its associativity?\n\n12.10 How can the size of a structure be determined? In what units is the size reported?\n\n12.11 What is the purpose of the typedef feature? How is this feature used in conjuction with structures?\n\n12.12 How is a structure-type pointer variable declared? To what does this type of variable point?\n\n12,13 What is the precedence of the -> operator? What is its associativity? Compare with the answers to\nReview Question 12.9,\n\n12.14 Suppose a pointer variable points to a structure that contains another structure as a member. How can\na member of the embedded structure be accessed?\n\n12.15 Suppose a member of a structure is a pointer variable. How can the object of the pointer be accessed,\nin terms of-the structure variable name and the member name?\n\n12.16 What happens when a pointer to a structure is incremented? What danger is associated with this type\nof operation?\n\n12.17 How can an entire structure be passed to a function?\n\n12,18 How can an entire structure be returned from a function?\n\n12.19 What is a self-referential structure? For what kinds of applications are self-referential structures use-\nful?\n\n12.20 What is a union? How does a union differ from a structure?\n\n12.21 For what kinds of applications are unions useful?\n\n12.22 In what sense can unions, structures, and arrays be intermixed?\n\n. =\n12.23 How is a union member accessed? How can a union member be processed? Casper came =\n12.24 How is a member of a union variable assigned i pat ea way does the iMitialization of\n12.25 sttarteepacesanraetedings ca sae an Compare oily the rules that apply to the Process,\n\ning Structures. hi\n\n1.1 Answer the.following questions as they pertain to your particular C compiler or interpreter.",
        "sub_question_number": "a",
        "sub_question_text": "Can an entire structure variable"
    },
    {
        "question_number": "12.7",
        "question_text": "What is the scope of a member name? What does this imply with respect to the naming of the mem-\nbers within different structures?\n\n12.8 How isa structure member accessed? How can a structure member be processed?\n\n12.9 What is the precedence of the period (.) operator? What is its associativity?\n\n12.10 How can the size of a structure be determined? In what units is the size reported?\n\n12.11 What is the purpose of the typedef feature? How is this feature used in conjuction with structures?\n\n12.12 How is a structure-type pointer variable declared? To what does this type of variable point?\n\n12,13 What is the precedence of the -> operator? What is its associativity? Compare with the answers to\nReview Question 12.9,\n\n12.14 Suppose a pointer variable points to a structure that contains another structure as a member. How can\na member of the embedded structure be accessed?\n\n12.15 Suppose a member of a structure is a pointer variable. How can the object of the pointer be accessed,\nin terms of-the structure variable name and the member name?\n\n12.16 What happens when a pointer to a structure is incremented? What danger is associated with this type\nof operation?\n\n12.17 How can an entire structure be passed to a function?\n\n12,18 How can an entire structure be returned from a function?\n\n12.19 What is a self-referential structure? For what kinds of applications are self-referential structures use-\nful?\n\n12.20 What is a union? How does a union differ from a structure?\n\n12.21 For what kinds of applications are unions useful?\n\n12.22 In what sense can unions, structures, and arrays be intermixed?\n\n. =\n12.23 How is a union member accessed? How can a union member be processed? Casper came =\n12.24 How is a member of a union variable assigned i pat ea way does the iMitialization of\n12.25 sttarteepacesanraetedings ca sae an Compare oily the rules that apply to the Process,\n\ning Structures. hi\n\n1.1 Answer the.following questions as they pertain to your particular C compiler or interpreter.",
        "sub_question_number": "5",
        "sub_question_text": "Can an entire structure variable"
    },
    {
        "question_number": "12.7",
        "question_text": "What is the scope of a member name? What does this imply with respect to the naming of the mem-\nbers within different structures?\n\n12.8 How isa structure member accessed? How can a structure member be processed?\n\n12.9 What is the precedence of the period (.) operator? What is its associativity?\n\n12.10 How can the size of a structure be determined? In what units is the size reported?\n\n12.11 What is the purpose of the typedef feature? How is this feature used in conjuction with structures?\n\n12.12 How is a structure-type pointer variable declared? To what does this type of variable point?\n\n12,13 What is the precedence of the -> operator? What is its associativity? Compare with the answers to\nReview Question 12.9,\n\n12.14 Suppose a pointer variable points to a structure that contains another structure as a member. How can\na member of the embedded structure be accessed?\n\n12.15 Suppose a member of a structure is a pointer variable. How can the object of the pointer be accessed,\nin terms of-the structure variable name and the member name?\n\n12.16 What happens when a pointer to a structure is incremented? What danger is associated with this type\nof operation?\n\n12.17 How can an entire structure be passed to a function?\n\n12,18 How can an entire structure be returned from a function?\n\n12.19 What is a self-referential structure? For what kinds of applications are self-referential structures use-\nful?\n\n12.20 What is a union? How does a union differ from a structure?\n\n12.21 For what kinds of applications are unions useful?\n\n12.22 In what sense can unions, structures, and arrays be intermixed?\n\n. =\n12.23 How is a union member accessed? How can a union member be processed? Casper came =\n12.24 How is a member of a union variable assigned i pat ea way does the iMitialization of\n12.25 sttarteepacesanraetedings ca sae an Compare oily the rules that apply to the Process,\n\ning Structures. hi\n\n1.1 Answer the.following questions as they pertain to your particular C compiler or interpreter.",
        "sub_question_number": "c",
        "sub_question_text": "Can an entire structure variable"
    },
    {
        "question_number": "12.7",
        "question_text": "What is the scope of a member name? What does this imply with respect to the naming of the mem-\nbers within different structures?\n\n12.8 How isa structure member accessed? How can a structure member be processed?\n\n12.9 What is the precedence of the period (.) operator? What is its associativity?\n\n12.10 How can the size of a structure be determined? In what units is the size reported?\n\n12.11 What is the purpose of the typedef feature? How is this feature used in conjuction with structures?\n\n12.12 How is a structure-type pointer variable declared? To what does this type of variable point?\n\n12,13 What is the precedence of the -> operator? What is its associativity? Compare with the answers to\nReview Question 12.9,\n\n12.14 Suppose a pointer variable points to a structure that contains another structure as a member. How can\na member of the embedded structure be accessed?\n\n12.15 Suppose a member of a structure is a pointer variable. How can the object of the pointer be accessed,\nin terms of-the structure variable name and the member name?\n\n12.16 What happens when a pointer to a structure is incremented? What danger is associated with this type\nof operation?\n\n12.17 How can an entire structure be passed to a function?\n\n12,18 How can an entire structure be returned from a function?\n\n12.19 What is a self-referential structure? For what kinds of applications are self-referential structures use-\nful?\n\n12.20 What is a union? How does a union differ from a structure?\n\n12.21 For what kinds of applications are unions useful?\n\n12.22 In what sense can unions, structures, and arrays be intermixed?\n\n. =\n12.23 How is a union member accessed? How can a union member be processed? Casper came =\n12.24 How is a member of a union variable assigned i pat ea way does the iMitialization of\n12.25 sttarteepacesanraetedings ca sae an Compare oily the rules that apply to the Process,\n\ning Structures. hi\n\n1.1 Answer the.following questions as they pertain to your particular C compiler or interpreter.",
        "sub_question_number": "d",
        "sub_question_text": "Can a-pointer to a structure"
    },
    {
        "question_number": "13.4",
        "question_text": "What is the purpose of the £close function? Must a call to this function appear within a program that\nutilizes a data file?\n\n13.5 Differentiate between the text and binary files.\n\n13.6 Describe two different approaches to updating a data file. Which approach is better and why?\n\n13.7 Contrast the use of the fscanf and fprintf functions with the use of the scanf and printf-\nfunctions described in Chapter 4. How do the grammatical rules differ?\n\n13.8 For what kinds of applications are unformatted data'files well suited? .\n\n13.9 Contrast the use of the fread and fwrite functions with the use of the fscanf and fprintf func-\ntions. How do the grammatical rules differ? For what kinds of applications is each group of functions\nwell suited?\n\n13.10 What is the purpose of the library function feof? How might the feof function be utilized within a\nprogram that updates an unformatted data file?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "14.1",
        "question_text": "What is meant by a low-level programming?\n\n14.2 What are registers? In general terms, what are registers used for?\n\n14.3 What is the purpose of the register storage class? What benefits are obtained from the use of this\nstorage class? What types of variables can be assigned this storage class? What is the scope of register\nvariables? :\n\n14.4 Why might a register declaration not be honored? How can a programmer tell if a register decla-\nration is honored within a program? If a register declaration is not honored, how are the register\nvariables treated?\n\n14.5 What is the purpose of the one's complement operator? To what types of operands does it apply? To\n\nwhat precedence group does it belong? What is its associativity?\n\n14.6 Describe the three logical bitwise operators. What is the purpose of each?",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "14.7",
        "question_text": "What types of operands are required by each of the logical bitwise operators?\n\n14.8 Describe the precedence and the associativity for each of the logical bitwise operators.\n\n14.9 What is a masking operation? What is the purpose of each operand? Which operand is the mask, and\nhow is it chosen?\n\n14.10 Describe a masking operation in which a portion of a given bit pattern is copied while the remaining\nbits are all set to 0. Which logical bitwise operation is used for this operation? How is the mask se-\nlected?\n\n14.11 Describe a masking operation in which a portion of a given bit pattern is copied while the remaining\nbits are all set to 1. Which logical bitwise operation is used for this operation? How is the mask defined?\nCompare your answer with the answer to the previous question.\n\n14.12 Describe a masking operation in which a portion of a given bit pattern is copied while the remaining\nbits are inverted. Which logical bitwise operation is used for this operation? How is the mask defined?\nCompare your answer with the answers to the previous two questions,\n\n14.13, Why is the one's complement operator sometimes used in a masking operation? Under what conditions\nis its use desirable?\n\n| a ——— SE EE |\n\n14.14 How can a particular bit be toggled on and off repeatedly? Which logical bitwise operation is used for\nthis purpose?\n\n14.15 Describe the two bitwise shift operators. What requirement must the operands satisfy? What is the\npurpose of each operand?\n\n14.16 Describe the precedence and the associativity for the bitwise shift operators.\n\n14.17 When shifting bits to the left or to the right, what happens to the bits shifted out of the original word\nposition?\n\n14.18 When shifting bits to the left, what value fills the rightmost bit positions that are vacated by the shift-\n\ning bits?\n\n14.19 When shifting bits to the right, what value fills the leftmost bit positions that are vacated by the shift-\n\ning bits? Does the type of operand being shifted affect this value? Explain completely. Compare your\nanswer with the answer to the last question. .\n\n14.20 Do all C compilers handle right-shift operations in the same manner? Explain completely.\n\n14.21 Describe the precedence and the associativity for the bitwise assignment operators.\n\n14.22 What are bit fields? To what type of data structure do bit fields belong? How are individual bit fields\naccessed?\n\n14.23 What data type must be associated with each bit field? What happens if a bit field overlaps a word\nwithin the computer's memory?\n\n14.24 Within a bit field declaration, what interpretation is given to an unnamed bit field? What interpretation\nis given to a zero-width field? ,\n\n14.25 In what order are the bit fields arranged within a word? Is this convention uniform among all\ncompilers? —\n\n14.26 What restrictions apply to the use of bit fields within a program, after they have been properly\ndeclared? , iy",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "a",
        "sub_question_text": "Shifting a binary number to the left » bits and multiplying the binary number by 2\"."
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "6",
        "sub_question_text": "Shifting a binary number to the right # bits and dividing the binary number by 2\""
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "a",
        "sub_question_text": "Enter the contents of an ordinary text file from the keyboard."
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "b",
        "sub_question_text": "Save the current text file in its present state"
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "c",
        "sub_question_text": "Retrieve a text file that has been saved"
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "d",
        "sub_question_text": "Encode or decode the current text file"
    },
    {
        "question_number": "14.7",
        "question_text": "Write a C program that will illustrate the equivalence between",
        "sub_question_number": "e",
        "sub_question_text": "Display the current text file in its present state"
    },
    {
        "question_number": "15.1",
        "question_text": "What is an enumeration? How is an enumeration defined?\n15.2 What are enumeration constants? In what form are they written?\n15.3 Can two or more enumeration constants have the same numerical value? Explain.\n15.4 What are enumeration variables? How are they declared?\n15.5 In what ways can enumeration variables be processed? What restrictions apply to the processing of\nenumeration variables? .\n15.6 What advantage is there in using enumeration variables within a program?\n15.7 Most C programs recognize two formal arguments in the definition of function main. What are they\ntraditionally called? What are their respective data types?\n15.8 When parameters are passed to a program from the command line, how is the program execution initi-\nated? Where do the parameters appear?\n15.9 What useful purpose can be served by command line parameters when executing a program involving\nthe use of data files? . )\n15.10 What is a macro? Summarize the similarities and differences between macros and functions.\n15.11 How is a multiline macro defined?\n\na\n15.12 Describe the use of arguments within a macto.\n15.13 What is the principal advantage in the use of a macro rather than a function? What is the principal\ndisadvantage? What other disadvantages are there? ie)\n15.14 What is the scope of a preprocessor directive within a program file? CnMe\n15.15 Summarize the special preprocessor operators # and ##. What is the purpose of each?\n15.16 What is meant by conditional compilation? In general terms, how is conditional compilation carried\nout? What preprocessor directives are available for this purpose?\n\nTION TIMES 4IlU LUG DIZ0D Ua EY weep oo",
        "sub_question_number": null,
        "sub_question_text": null
    },
    {
        "question_number": "14.4",
        "question_text": "Write a C program that will accept a hexadecimal number as input, and then display a menu that y;\npermit any of the following operations to be carried out: at will",
        "sub_question_number": "a",
        "sub_question_text": "Display the hexadecimal equivalent of the one's complement."
    },
    {
        "question_number": "14.4",
        "question_text": "Write a C program that will accept a hexadecimal number as input, and then display a menu that y;\npermit any of the following operations to be carried out: at will",
        "sub_question_number": "b",
        "sub_question_text": "Carry out a masking operation and then display the hexadecimal equivalent of the result"
    },
    {
        "question_number": "14.4",
        "question_text": "Write a C program that will accept a hexadecimal number as input, and then display a menu that y;\npermit any of the following operations to be carried out: at will",
        "sub_question_number": "c",
        "sub_question_text": "Carry out a bit shifting operation and then display the hexadecimal equivalent of the _"
    },
    {
        "question_number": "14.4",
        "question_text": "Write a C program that will accept a hexadecimal number as input, and then display a menu that y;\npermit any of the following operations to be carried out: at will",
        "sub_question_number": "d",
        "sub_question_text": "Exit. :\nIf the masking operation is selected, prompt the user for the type of operation"
    }
]
